

x = [{'z':'小明','x':12,'c':'男'},{'z':'小红','x':11,'c':'女'},{'z':'老王','x':45,'c':'男'}]
while True:
    print("""
    欢迎使用学生管理系统
    输入对应编号进行操作:
    1-查询学员姓名
    2-添加学员姓名
    3-修改学员姓名
    4-删除学员姓名
    0-退出程序'""")
    n = int(input('请输入编号:'))
    if n == 1:
        print('编号', '\t', '姓名','\t','年龄','\t','性别')
        print('-----------------')
        for i in range(0, len(x)):
            v = (i + 1, '\t''\t')
            print(v,[{'z':'小明','x':12,'c':'男'},{'z':'小红','x':11,'c':'女'},{'z':'老王','x':45,'c':'男'}])
